
; HELLO1.ASM -  ã¯à®é¥­­ ï ¢¥àá¨ï ãç¥¡­®© ¯à®£à ¬¬ë « ¡.à ¡. N1
;               ¯® ¤¨áæ¨¯«¨­¥ "€àå¨â¥ªâãà  ª®¬¯ìîâ¥à "
; *****************************************************************
;  §­ ç¥­¨¥: à®£à ¬¬  ä®à¬¨àã¥â ¨ ¢ë¢®¤¨â ­  íªà ­ ¯à¨¢¥âáâ¢¨¥
;             ¯®«ì§®¢ â¥«ï á ¯®¬®éìî äã­ªæ¨¨ „Ž‘ "‚ë¢®¤ áâà®ª¨"
;             (­®¬¥à 09 ¯à¥àë¢ ­¨¥ 21h), ª®â®à ï:
;              - ®¡¥á¯¥ç¨¢ ¥â ¢ë¢®¤ ­  íªà ­ áâà®ª¨ á¨¬¢®«®¢,
;                § ª ­ç¨¢ îé¥©áï §­ ª®¬ "$";
;              - âà¥¡ã¥â § ¤ ­¨ï ¢ à¥£¨áâà¥ ah ­®¬¥à  äã­ªæ¨¨=09h,
;                  ¢ à¥£¨áâà¥ dx -  á¬¥é¥­¨ï   ¤à¥á   ¢ë¢®¤¨¬®©
;                áâà®ª¨;
;              - ¨á¯®«ì§ã¥â à¥£¨áâà  ax  ¨  ­¥ á®åà ­ï¥â ¥£®
;                á®¤¥à¦¨¬®¥.
; ******************************************************************

   DOSSEG                                      ; ‡ ¤ ­¨¥ á¥£¬¥­â®¢ ¯®¤ „Ž‘
   .MODEL  SMALL                               ; Œ®¤¥«ì ¯ ¬ïâ¨-SMALL(Œ « ï)
   .STACK  100h                                ; Žâ¢¥áâ¨ ¯®¤ ‘â¥ª 256 ¡ ©â
   .DATA                                       ;  ç «® á¥£¬¥­â  ¤ ­­ëå
Greeting  LABEL  BYTE                          ; ’¥ªáâ  ¯à¨¢¥âáâ¢¨ï
   DB '‚ á ¯à¨¢¥âáâ¢ã¥â áâ.£à.7303 - ˆ¢ ­®¢ ˆ.ˆ.',13,10,'$'
   .CODE                                ;  ç «® á¥£¬¥­â  ª®¤ 
   mov  ax, @data                        ; ‡ £àã§ª  ¢ DS  ¤à¥á  ­ ç « 
   mov  ds, ax                           ; á¥£¬¥­â  ¤ ­­ëå
   mov  dx, OFFSET Greeting              ; ‡ £àã§ª  ¢ dx á¬¥é¥­¨ï
                                        ;  ¤à¥á  â¥ªáâ  ¯à¨¢¥âáâ¢¨ï
DisplayGreeting:
   mov  ah, 9                            ; # äã­ªæ¨¨ „Ž‘ ¯¥ç â¨ áâà®ª¨
   int  21h                             ; ¢ë¢®¤ ­  íªà ­  ¯à¨¢¥âáâ¢¨ï
   mov  ah, 4ch                          ; # äã­ªæ¨¨ „Ž‘ § ¢¥àè¥­¨ï ¯à®£à ¬¬ë
   int  21h                             ; § ¢¥àè¥­¨¥ ¯à®£à ¬¬ë ¨ ¢ëå®¤ ¢ „Ž‘
   END